dataset = {
    "choose_profile_type": {
        "message": "Выберите тип профиля:",

        "profile_types": {
            "passenger": "👤 Пассажир",
            "driver": "🚗 Водитель",
        },

        "error": "Пожалуйста, выберите один из вариантов.",
    },

    "register": {
        "enter_name": "Введите ваше имя:",
        "enter_car_brand": "Введите марку вашего автомобиля:",
        "enter_seating_capacity": "Введите количество мест в вашем автомобиле:",
        "enter_is_child_seat": "У вас есть детское кресло?",

        "enter_about": "Расскажите о себе:",
        "is_it_correct": "Все верно?",
        "driver_info": "Имя: {name}\nМарка автомобиля: {car_brand}\nКоличество мест: {seating_capacity}\nДетское "
                       "кресло:"
                       "{is_child_seat}\nО себе: {about}",

        "success_register": "Вы успешно зарегистрированы!",
    },

    "menus": {
        "main_menu": {
            "message": "Выберите действие:",
        },

        "passenger_my_profile_menu": {
            "message": "Информация о вашем профиле:\n\nИмя: {0}",
        },
    },

    "change_language": {
        "message": "Выберите язык:",
        "success": "Язык успешно изменен.",
        "error": "Пожалуйста, выберите один из вариантов.",
    },

    "yes": "Да",
    "no": "Нет",

    "errors": {
        "unknown": "Произошла ошибка. Пожалуйста, попробуйте позже.",
        "not_registered": "Вы не зарегистрированы в нашей системе. Пожалуйста, зарегистрируйтесь.",
        "choose_from_list": "Пожалуйста, выберите один из вариантов.",
    },

    "keyboards": {
        "register": {
            "register": "Зарегистрироваться",
        },
        "main_menu": {
            "passenger": {
                "my_profile": "👤 Мой профиль",
                "call_taxi": "🚕 Вызвать такси",
                "book_taxi": "📅 Забронировать такси",
                "get_nearby_drivers_count": "👨‍✈️ Узнать количество дежурных таксистов поблизу",
            },
            "driver": {
                "my_profile": "🚗 Мой профиль",
                "set_my_geo_position": "📍 Указать мою геолокацию",
                "get_nearby_drivers_count": "👨‍✈️ Узнать количество дежурных таксистов поблизу",
            },
        },
        "passenger_my_profile_menu": {
            "edit_name": "✏️ Редактировать имя",
            "change_language": "🌐 Изменить язык",
            "back": "🔙 Назад",
        },
    }
}
