dataset = {
    "choose_profile_type": {
        "message": "Выберите тип профиля:",

        "profile_types": {
            "passenger": "👤 Пассажир",
            "driver": "🚗 Водитель",
        },

        "error": "Пожалуйста, выберите один из вариантов.",
    },

    "change_language": {
        "message": "Выберите язык:",
        "success": "Язык успешно изменен.",
    },

    "errors": {
        "unknown": "Произошла ошибка. Пожалуйста, попробуйте позже.",
        "not_registered": "Вы не зарегистрированы в нашей системе. Пожалуйста, зарегистрируйтесь.",
    },

    "keyboards": {
        "register": {
            "register": "Зарегистрироваться",
        },
    }
}
